app/views/articles/admin.html.erb

        <td><%= truncate(article.body, length: 1000, separator: ' ') %></td>
        <td><%= article.comments.count %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 12]]