app/views/articles/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 12]]
---
        <td><%= truncate(article.body, length: 1000, separator: ' ') %></td>
        <td><%= article.comments.count %></td>