app/views/articles/show.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY "comments"."created_at" DESC LIMIT $2  [["article_id", 1], ["LIMIT", 1]]
---
<h2>Comments</h2>
<% @article.comments.each do |comment| %>