app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT $1  [["LIMIT", 10]]
---
  def index
    @articles = Article.order(created_at: :desc).first(10)

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def admin
    @articles = Article.order(created_at: :desc)

SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY "comments"."created_at" DESC LIMIT $2  [["article_id", 1], ["LIMIT", 1]]
---
  def show
    @comments =Article.find(params[:id]).comments.order(created_at: :desc)

INSERT INTO "articles" ("author", "drop", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Rosario"], ["drop", "emnsafoij"], ["body", "ginrgionqelrv"], ["created_at", 2017-03-13 14:14:01 UTC], ["updated_at", 2017-03-13 14:14:01 UTC]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save