app/controllers/comments_controller.rb

  def create
  	@article = Article.find(params[:article_id])
  	@comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("article_id", "author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["article_id", 1], ["author", "ds"], ["content", "tg"], ["created_at", 2017-03-13 17:17:09 UTC], ["updated_at", 2017-03-13 17:17:09 UTC]]